{"tool":"marketing","status":"FAIL","reports":{"tool":"marketing","vendor":"openpix","extension":"pix","version":"1.0.2","status":"FAIL","date":"2021-06-10 00:54:08","details":{"reasons":["Content Language - English must be the primary language used in your listing. The EXTENSION TITLE, SHORT DESCRIPTION, &amp; COMPANY BIO (in your account profile) must be in <strong>English only. <\/strong>Youare welcome to include a second language in your<span style=\"text-decoration: underline;\"> LONG DESCRIPTION<\/span> if you adhere to the following guidelines.<br \/><br \/>&nbsp;1. The English description must come <strong>first<\/strong>.<br \/>&nbsp;2. The two languages should be separated with a <strong>horizontal line<\/strong>.<br \/>&nbsp;3. The English section and the second language section should have the <strong>same content and links<\/strong>.","INCOMPLETE LONG DESCRIPTION - Due to the amount of missing content and\/or content that was incorrectly submitted in the LONG DESCRIPTION, this extension appears to have been submitted prematurely and cannot continue in the review process until the submission has been updated in accordance with the guidelines.<br \/><br \/><span style=\"text-decoration: underline;\">Please review all submissions guidelines in the following links:<\/span><br \/><strong><a href=\"https:\/\/devdocs.magento.com\/marketplace\/sellers\/marketing-review-guidelines.html\" target=\"_blank\">Marketing Review Guidelines<\/a><br \/><a href=\"https:\/\/devdocs.magento.com\/marketplace\/sellers\/product-descriptions.html\" target=\"_blank\">Descriptions<\/a><br \/><a href=\"https:\/\/devdocs.magento.com\/marketplace\/sellers\/content.html\" target=\"_blank\">Content Guidelines<\/a><br \/><a href=\"https:\/\/devdocs.magento.com\/marketplace\/sellers\/marketing-submission-preview.html\" target=\"_blank\">Preview Your Listing Before Submitting<\/a><\/strong><br \/><br \/><strong>ATTACHED TO THIS EMAIL IS A LIST OF EXAMPLES TO HELP WITH YOUR LONG DESCRIPTION.<\/strong>","Images (Update Needed) - Please update the EXTENSION IMAGES so that they better represent the extension's functionality. See the <a href=\"https:\/\/devdocs.magento.com\/marketplace\/sellers\/image-tips.html\" target=\"_blank\"><strong>Image Guidelines <\/strong><\/a>for more information.","Short Description - Update the SHORT DESCRIPTION. The Short Description should provide a brief summary of what your extension does.","INTEGRATION: Long Description Formatting - <strong>LONG DESCRIPTIONS for INTEGRATION extensions require specific information and special formatting. Please read the following carefully and make sure all items are included and formatted properly before resubmitting:<\/strong><br \/><br \/><strong>1. <\/strong>&nbsp;Begin with an<strong> introductory paragraph<\/strong> in the long description that gives background information about the <strong>COMPANY\/SERVICE<\/strong> with which your extension is integrating. Turn the first mention of that company\/service into a <strong>BOLD<\/strong> hyperlink that leads to the company\/service website.<br \/><br \/><strong><em><span style=\"color: #ff0000;\">Example:<\/span>&nbsp;<\/em><\/strong>If a developer was submitting an integration with a company called <em><span style=\"text-decoration: underline;\">EXAMPLE COMPANY<\/span><\/em>, their long description would begin with a paragraph about<span style=\"text-decoration: underline;\"> <em>EXAMPLE COMPANY<\/em><\/span>, and the first mention of \"<em><span style=\"text-decoration: underline;\">EXAMPLE COMPAN<\/span><\/em><span style=\"text-decoration: underline;\">Y<\/span>\" would be a bold hyperlink that leads to the <em><span style=\"text-decoration: underline;\">EXAMPLE COMPANY<\/span><\/em> website.<br \/><br \/><br \/><strong>2. <\/strong>&nbsp;Next, add a <strong>second paragraph<\/strong> that describes the <strong>EXTENSION\/INTEGRATION<\/strong>. Make it clear what the extension can do for the customer and how the extension works. You may want to provide examples of cases when the extension might be used. Leave the merchant with a solid understanding of how their site will appear and function if they purchase your extension.<br \/><em><br \/><\/em>&nbsp;<span style=\"color: #ff0000;\"><strong><em>Example: <\/em><\/strong><\/span>The developer from the example above would then add a second paragraph that describes the features and functionality of the extension itself and how the integration with <em><span style=\"text-decoration: underline;\">EXAMPLE COMPANY<\/span><\/em> would benefit the Magento merchant.<br \/><br \/><br \/><strong>3. <\/strong>&nbsp;Immediately after these paragraphs, add an \"Account &amp; Pricing\" section <strong>IN BOLD<\/strong>:<br \/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull; Add an \"Account &amp; Pricing\" heading, using Header 2 or Header 3.<br \/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull; Clearly state whether or not a separate account is required.<br \/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull; Clearly state whether or not the account is created during extension installation, or if it must be done separately.<br \/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull; If it must be done separately, supply a link to the sign-up page.<br \/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull; Clearly state whether or not additional fees apply for the service (not the extension). If the service is free, say that.<br \/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull; Add a link to the pricing page if there is one.<br \/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &bull; If the merchant needs to contact the company for account set up and pricing, provide the contact information.<br \/><br \/><br \/><strong>4.<\/strong>&nbsp; After the <em>Account &amp; Pricing<\/em> section should come your extension features and any other content that you wish to include.","Features - In the LONG DESCRIPTION, list the FEATURES of the extension vertically, with bullet points, under a <strong>\"Features\"<\/strong> heading.<br \/>&bull;Please <span style=\"text-decoration: underline;\">ONLY<\/span> use the bullet point button found in the Marketplace editor when using bullet points in your submission.<br \/>&bull;Format the \"Features:\" heading with Header 3 or Header 2.","Security & PCI Compliance - Due to increased payment security disclosure requirements, please add a separate SECURITY section to the Long Description. When adding this, please do not remove any of the information that you have already listed.<br \/><br \/>&bull;&nbsp; In the Long Description, add a \"Security\" heading. Below it, add much more information about security features and PCI compliance (if applicable).<br \/>&bull; Outline the method being used (API, or Redirect, or both) and how that interacts with the PCI Compliance.<br \/>&bull; Specify if the customer is entering their payment data on the merchant site directly or if they are being redirected for payment.<br \/>&bull; Make it clear which SAQ level your integration meets.<br \/>&bull; Clearly State whether or not customer data is being entered into the Magento server<br \/>&bull; Clearly state whether or not customer data is being stored on the Magento server.","Headings - Add HEADINGS to the LONG DESCRIPTION (\"<em>Features\", \"Demos\", \"Benefits\"<\/em>, etc.). Format headings with Header 2 or Header 3.<br \/><br \/><strong><span style=\"text-decoration: underline;\">Reminders:<\/span><\/strong><br \/>&nbsp;&nbsp;&nbsp; &bull; Do NOT add a heading at the top of the long description.<br \/>&nbsp;&nbsp;&nbsp; &bull; If you are adding <span style=\"text-decoration: underline;\">subheadings<\/span>, use Header 2 for the main heading and Header 3 for the subheadings.<br \/>&nbsp;&nbsp;&nbsp; &bull; Capitalize the first letter of each word in the headings."],"message":"","attachment":""}}}